<template>
  <div>
    <!-- <h-table border :columns="columns2" :data="data"></h-table> -->
    <h-table border notSetWidth :columns="tbcolumns" :data="tbdata" ></h-table>
  </div>
</template>
<script>
export default {
  data() {
    return {
      columns2: [
        {
          title: "姓名",
          key: "name",
          width: 100
          // fixed: 'left'
        },
        {
          title: "年龄",
          key: "age",
          width: 100
        },
        {
          title: "省份",
          key: "province",
          width: 100
        },
        {
          title: "市区",
          key: "city",
          width: 100
        },
        {
          title: "地址",
          key: "address",
          width: 200
        },
        {
          title: "邮编",
          key: "zip"
          // width: 100
        },
        {
          title: "操作",
          key: "action",
          fixed: "right",
          width: 120,
          render: (h, params) => {
            return h("div", [
              h(
                "Button",
                {
                  props: {
                    type: "text",
                    size: "small"
                  }
                },
                "查看"
              ),
              h(
                "Button",
                {
                  props: {
                    type: "text",
                    size: "small"
                  }
                },
                "编辑"
              )
            ]);
          }
        }
      ],
      data3: [
        {
          name: "王小明",
          age: 18,
          address: "北京市朝阳区芍药居",
          province: "北京市",
          city: "朝阳区",
          zip: 100000
        },
        {
          name: "张小刚",
          age: 25,
          address: "北京市海淀区西二旗",
          province: "北京市",
          city: "海淀区",
          zip: 100000
        },
        {
          name: "李小红",
          age: 30,
          address: "上海市浦东新区世纪大道",
          province: "上海市",
          city: "浦东新区",
          zip: 100000
        },
        {
          name: "周小伟",
          age: 26,
          address: "深圳市南山区深南大道",
          province: "广东",
          city: "南山区",
          zip: 100000
        }
      ],
      data: [],
      tbdata: [
        {
          基金名称: "C类基金测试",
          基金代码: "01C001",
          基金总份额: 19158097.73,
          基金总净值: 19158097.73,
          基金单位净值: 1,
          基金公司有效投资者账户总数: 188,
          机构投资者账户数: 47,
          "机构投资者账户数(有效)": 45,
          个人投资者账户数: 151,
          "个人投资者账户数(有效)": 143,
          直销账户数: 0,
          "直销账户数(有效)": 0,
          ROW_ID: 1
        },
        {
          基金名称: "QDII货币",
          基金代码: "6250A0",
          基金总份额: 3933453292.1,
          基金总净值: 3933453292.1,
          基金单位净值: 1,
          基金公司有效投资者账户总数: 259,
          机构投资者账户数: 108,
          "机构投资者账户数(有效)": 105,
          个人投资者账户数: 155,
          "个人投资者账户数(有效)": 154,
          直销账户数: 1,
          "直销账户数(有效)": 1,
          ROW_ID: 2
        },
        {
          基金名称: "QDII基金",
          基金代码: "625010",
          基金总份额: 3810469385.79,
          基金总净值: 3887440867.38,
          基金单位净值: 1.0202,
          基金公司有效投资者账户总数: 974,
          机构投资者账户数: 392,
          "机构投资者账户数(有效)": 388,
          个人投资者账户数: 593,
          "个人投资者账户数(有效)": 586,
          直销账户数: 42,
          "直销账户数(有效)": 40,
          ROW_ID: 3
        },
        {
          基金名称: "QDII基金2(月薪按双月",
          基金代码: "625020",
          基金总份额: 326756111.52,
          基金总净值: 360902125.17,
          基金单位净值: 1.1045,
          基金公司有效投资者账户总数: 290,
          机构投资者账户数: 118,
          "机构投资者账户数(有效)": 115,
          个人投资者账户数: 178,
          "个人投资者账户数(有效)": 175,
          直销账户数: 0,
          "直销账户数(有效)": 0,
          ROW_ID: 4
        },
        {
          基金名称: "T0分级A1（非实时",
          基金代码: "2ZR010",
          基金总份额: 1760123.29,
          基金总净值: 1760123.29,
          基金单位净值: 1,
          基金公司有效投资者账户总数: 849,
          机构投资者账户数: 367,
          "机构投资者账户数(有效)": 339,
          个人投资者账户数: 550,
          "个人投资者账户数(有效)": 510,
          直销账户数: 213,
          "直销账户数(有效)": 196,
          ROW_ID: 5
        },
        {
          基金名称: "T0分级A2（非实时",
          基金代码: "2ZR030",
          基金总份额: 1757203.34,
          基金总净值: 1757203.34,
          基金单位净值: 1,
          基金公司有效投资者账户总数: 826,
          机构投资者账户数: 357,
          "机构投资者账户数(有效)": 326,
          个人投资者账户数: 543,
          "个人投资者账户数(有效)": 500,
          直销账户数: 209,
          "直销账户数(有效)": 191,
          ROW_ID: 6
        },
        {
          基金名称: "T0分级A3（非实时",
          基金代码: "2ZR050",
          基金总份额: 1723548.94,
          基金总净值: 1723548.94,
          基金单位净值: 1,
          基金公司有效投资者账户总数: 852,
          机构投资者账户数: 368,
          "机构投资者账户数(有效)": 335,
          个人投资者账户数: 560,
          "个人投资者账户数(有效)": 517,
          直销账户数: 214,
          "直销账户数(有效)": 193,
          ROW_ID: 7
        },
        {
          基金名称: "T0分级A4（非实时",
          基金代码: "2ZR070",
          基金总份额: 1737913.68,
          基金总净值: 1737913.68,
          基金单位净值: 1,
          基金公司有效投资者账户总数: 821,
          机构投资者账户数: 355,
          "机构投资者账户数(有效)": 324,
          个人投资者账户数: 543,
          "个人投资者账户数(有效)": 497,
          直销账户数: 209,
          "直销账户数(有效)": 191,
          ROW_ID: 8
        },
        {
          基金名称: "T0分级B1（非实时",
          基金代码: "2ZR020",
          基金总份额: 350207281.94,
          基金总净值: 350207281.94,
          基金单位净值: 1,
          基金公司有效投资者账户总数: 944,
          机构投资者账户数: 323,
          "机构投资者账户数(有效)": 293,
          个人投资者账户数: 694,
          "个人投资者账户数(有效)": 651,
          直销账户数: 223,
          "直销账户数(有效)": 205,
          ROW_ID: 9
        },
        {
          基金名称: "T0分级B2（非实时",
          基金代码: "2ZR040",
          基金总份额: 350210369.69,
          基金总净值: 350210369.69,
          基金单位净值: 1,
          基金公司有效投资者账户总数: 947,
          机构投资者账户数: 323,
          "机构投资者账户数(有效)": 293,
          个人投资者账户数: 697,
          "个人投资者账户数(有效)": 654,
          直销账户数: 223,
          "直销账户数(有效)": 205,
          ROW_ID: 10
        }
      ],
      tbcolumns: [
        {
          key: "基金名称",
          title: "基金名称"
        },
        {
          key: "基金代码",
          title: "基金代码"
        },
        {
          key: "基金总份额",
          title: "基金总份额"
        },
        {
          key: "基金总净值",
          title: "基金总净值"
        },
        {
          key: "基金单位净值",
          title: "基金单位净值"
        },
        {
          key: "基金公司有效投资者账户总数",
          title: "基金公司有效投资者账户总数"
        },
        {
          key: "机构投资者账户数",
          title: "机构投资者账户数"
        },
        {
          key: "机构投资者账户数(有效)",
          title: "机构投资者账户数(有效)"
        },
        {
          key: "个人投资者账户数",
          title: "个人投资者账户数"
        },
        {
          key: "个人投资者账户数(有效)",
          title: "个人投资者账户数(有效)"
        },
        {
          key: "直销账户数",
          title: "直销账户数"
        },
        {
          key: "直销账户数(有效)",
          title: "直销账户数(有效)"
        }
      ]
    };
  }
};
</script>
